# Определение результата финансовой деятельности, рентабельности и прибыли, приходящейся на одного сотрудника
vir = int(input("Введите величину Вашей выручки (в рублях): "))
izd = int(input("Введите величину Ваших издержек ( в рублях): "))
# rs - результат деятельности по формуле выручка - издержка
rs = vir - izd
if rs > 0:
    print(f"Ваша прибыль составила: {rs} рублей.")
    # rnt - рентабельность, отношение прибыли к выручке
    rnt = rs / vir
    print("Рентабельность выручки равна: {:.0%}.".format(rnt))
    # ppl - количество сотрудников
    ppl = int(input("Введите кол-во сотрудников: "))
    # prb - прибыль, приходящяяся на одного сотрудника
    prb = rs / ppl
    print("Прибыль в расчёте на одного сотрудника составила: {:.0f} рублей.".format(prb))
else:
    print(f"Ваш убыток составил {-rs} рублей")
